ERM/src/Documents/SalesOrder.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>SalesOrder</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ArInvoice</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SiebelOrderId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FieldTicket</Name>
					<Comment>Номер FTL</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IssueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JobEndDate</Name>
					<Comment>Дата окончания работ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FTLSubmissionDate</Name>
					<Comment>Дата подтверждения Field Ticket  ( в FTL )</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ApprovalDate</Name>
					<Comment>Дата подтверждения этого ордера менеджером (в CRM)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FirstSubmissionDate</Name>
					<Comment>Дата подтверждения готовности ордера для выставления счета-фактуры (в CRM) </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ERPStatus</Name>
					<Comment>Статус Ордера в ERP</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FTLCreatedBy</Name>
					<Comment>Кем FTL сделан</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FTLApproverID</Name>
					<Comment>Кем FTL подтвержден</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ApprovedBy</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreatedBy</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InvoiceType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InvoiceTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OrderType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SalesOrederTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Agreement</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Comment>Дата создания Sales order ( в CRM )</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InvoiceFlagDate</Name>
					<Comment>Дата подгрузки счета - фактуры в ERP (Lawson/Oracle)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьGeoMarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubGeoMarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgreementCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgreementStatus</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgreementType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JobStartDate</Name>
					<Comment>Дата начала работ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AmountUSD</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OriginalAnalytics</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClientID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CREW</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/InformationRegisters/SalesOrderResponsibles.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>SalesOrderResponsibles</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ResponsibleAR</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LDAPUsers</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/ПолучателиУведомленийUnbilled.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПолучателиУведомленийUnbilled</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ResponsibleAR</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EscalationLevels</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LDAPUsers</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/ИдентификаторыДляНотификацийSO.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыДляНотификацийSO</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/Documents/SalesOrder/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьОтветственныхПоSO(SalesOrder, Уровень) Экспорт
	
	//СтруктураРеквизитовSO = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(SalesOrder, "Source, Client, Company, AU, Location, CREW");
	//
	//Если СтруктураРеквизитовSO.Source = Перечисления.ТипыСоответствий.Lawson Тогда
	//	Возврат ПолучитьОтветственныхПоSOLawson(СтруктураРеквизитовSO);
	//ИначеЕсли СтруктураРеквизитовSO.Source = Перечисления.ТипыСоответствий.OracleMI Тогда
	//	Возврат ПолучитьОтветственныхПоSOOracleMI(СтруктураРеквизитовSO);
	//ИначеЕсли СтруктураРеквизитовSO.Source = Перечисления.ТипыСоответствий.OracleSmith Тогда
	//	Возврат ПолучитьОтветственныхПоSOOracleSmith(СтруктураРеквизитовSO);
	//ИначеЕсли СтруктураРеквизитовSO.Source = Перечисления.ТипыСоответствий.HOBs Тогда
	//	Возврат ПолучитьОтветственныхПоSOHOB(СтруктураРеквизитовSO);
	//Иначе
	//	Возврат Новый Массив();
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SalesOrderResponsibles.ResponsibleAR
		|ИЗ
		|	РегистрСведений.SalesOrderResponsibles КАК SalesOrderResponsibles
		|ГДЕ
		|	SalesOrderResponsibles.SalesOrder = &SalesOrder
		|	И SalesOrderResponsibles.ResponsibleAR <> ЗНАЧЕНИЕ(Справочник.LDAPUsers.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("SalesOrder", SalesOrder);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивОтветственных = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ResponsibleAR");
	
	Если ЗначениеЗаполнено(Уровень) Тогда
		ДополнитьМассивОтветственных(SalesOrder, МассивОтветственных, Уровень);
	КонецЕсли;
	
	МассивОтветственных = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивОтветственных);
	
	Возврат МассивОтветственных;
	
КонецФункции

Процедура ДополнитьМассивОтветственных(SalesOrder, МассивОтветственных, Уровень)
	
	Если Уровень = Справочники.EscalationLevels.Level1 Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОтветственных, ПолучитьОтветственныхПоУровню(SalesOrder, Справочники.EscalationLevels.Level1));
	ИначеЕсли Уровень = Справочники.EscalationLevels.Level2 Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОтветственных, ПолучитьОтветственныхПоУровню(SalesOrder, Справочники.EscalationLevels.Level1));
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОтветственных, ПолучитьОтветственныхПоУровню(SalesOrder, Справочники.EscalationLevels.Level2));
	ИначеЕсли Уровень = Справочники.EscalationLevels.Level3 Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОтветственных, ПолучитьОтветственныхПоУровню(SalesOrder, Справочники.EscalationLevels.Level1));
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОтветственных, ПолучитьОтветственныхПоУровню(SalesOrder, Справочники.EscalationLevels.Level2));
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОтветственных, ПолучитьОтветственныхПоУровню(SalesOrder, Справочники.EscalationLevels.Level3));
	ИначеЕсли Уровень = Справочники.EscalationLevels.Level4 Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОтветственных, ПолучитьОтветственныхПоУровню(SalesOrder, Справочники.EscalationLevels.Level1));
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОтветственных, ПолучитьОтветственныхПоУровню(SalesOrder, Справочники.EscalationLevels.Level2));
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОтветственных, ПолучитьОтветственныхПоУровню(SalesOrder, Справочники.EscalationLevels.Level3));
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОтветственных, ПолучитьОтветственныхПоУровню(SalesOrder, Справочники.EscalationLevels.Level4));
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОтветственныхПоУровню(SalesOrder, Уровень)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолучателиУведомленийUnbilled.Получатель
		|ИЗ
		|	РегистрСведений.ПолучателиУведомленийUnbilled КАК ПолучателиУведомленийUnbilled
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыДляНотификацийSO КАК ИдентификаторыДляНотификацийSO
		|		ПО ПолучателиУведомленийUnbilled.Source = ИдентификаторыДляНотификацийSO.Source
		|			И ПолучателиУведомленийUnbilled.Идентификатор1 = ИдентификаторыДляНотификацийSO.Идентификатор1
		|			И ПолучателиУведомленийUnbilled.Идентификатор2 = ИдентификаторыДляНотификацийSO.Идентификатор2
		|			И (ИдентификаторыДляНотификацийSO.SalesOrder = &SalesOrder)
		|			И (ПолучателиУведомленийUnbilled.Уровень = &Уровень)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПолучателиУведомленийUnbilled.Получатель
		|ИЗ
		|	РегистрСведений.ПолучателиУведомленийUnbilled КАК ПолучателиУведомленийUnbilled
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыДляНотификацийSO КАК ИдентификаторыДляНотификацийSO
		|		ПО ПолучателиУведомленийUnbilled.Source = ИдентификаторыДляНотификацийSO.Source
		|			И ПолучателиУведомленийUnbilled.Идентификатор1 = ИдентификаторыДляНотификацийSO.Идентификатор1
		|			И (ПолучателиУведомленийUnbilled.Идентификатор2 = НЕОПРЕДЕЛЕНО
		|				ИЛИ ПолучателиУведомленийUnbilled.Идентификатор2 = """"
		|				ИЛИ ПолучателиУведомленийUnbilled.Идентификатор2 = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
		|			И (ИдентификаторыДляНотификацийSO.SalesOrder = &SalesOrder)
		|			И (ПолучателиУведомленийUnbilled.Уровень = &Уровень)";
	
	Запрос.УстановитьПараметр("SalesOrder", SalesOrder);
	Запрос.УстановитьПараметр("Уровень", Уровень);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Если НЕ МассивРезультатов[0].Пустой() Тогда
		ВыборкаДетальныеЗаписи = МассивРезультатов[0].Выбрать();
	Иначе
		ВыборкаДетальныеЗаписи = МассивРезультатов[1].Выбрать();
	КонецЕсли;
	
	МассивОтветственных = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МассивОтветственных.Добавить(ВыборкаДетальныеЗаписи.Получатель);
		
	КонецЦикла;
	
	Возврат МассивОтветственных;
	
КонецФункции

Функция ПолучитьОтветственныхПоSOLawson(СтруктураРеквизитовSO)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолучателиУведомленийUnbilled.Получатель
		|ИЗ
		|	РегистрСведений.ПолучателиУведомленийUnbilled КАК ПолучателиУведомленийUnbilled
		|ГДЕ
		|	ПолучателиУведомленийUnbilled.Source = &Source
		|	И ПолучателиУведомленийUnbilled.Идентификатор1 = &Идентификатор1
		|	И ПолучателиУведомленийUnbilled.Уровень = &Уровень
		|	И ПолучателиУведомленийUnbilled.Получатель.ResponsibleAR";
	
	Запрос.УстановитьПараметр("Source", Перечисления.ТипыСоответствий.Lawson);
	Запрос.УстановитьПараметр("Идентификатор1", СтруктураРеквизитовSO.AU);
	Запрос.УстановитьПараметр("Уровень", Справочники.EscalationLevels.Level1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Получатель");
	
КонецФункции

Функция ПолучитьОтветственныхПоSOOracleMI(СтруктураРеквизитовSO)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолучателиУведомленийUnbilled.Получатель
		|ИЗ
		|	РегистрСведений.ПолучателиУведомленийUnbilled КАК ПолучателиУведомленийUnbilled
		|ГДЕ
		|	ПолучателиУведомленийUnbilled.Source = &Source
		|	И ПолучателиУведомленийUnbilled.Идентификатор1 = &Идентификатор1
		|	И ПолучателиУведомленийUnbilled.Уровень = &Уровень
		|	И ПолучателиУведомленийUnbilled.Получатель.ResponsibleAR
		|	И ПолучателиУведомленийUnbilled.Идентификатор2 = &Идентификатор2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПолучателиУведомленийUnbilled.Получатель
		|ИЗ
		|	РегистрСведений.ПолучателиУведомленийUnbilled КАК ПолучателиУведомленийUnbilled
		|ГДЕ
		|	ПолучателиУведомленийUnbilled.Source = &Source
		|	И ПолучателиУведомленийUnbilled.Идентификатор1 = &Идентификатор1
		|	И ПолучателиУведомленийUnbilled.Уровень = &Уровень
		|	И ПолучателиУведомленийUnbilled.Получатель.ResponsibleAR
		|	И (ПолучателиУведомленийUnbilled.Идентификатор2 = НЕОПРЕДЕЛЕНО
		|			ИЛИ ПолучателиУведомленийUnbilled.Идентификатор2 = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Source", Перечисления.ТипыСоответствий.OracleMI);
	Запрос.УстановитьПараметр("Идентификатор1", СтруктураРеквизитовSO.Location);
	Запрос.УстановитьПараметр("Идентификатор2", СтруктураРеквизитовSO.Client);
	Запрос.УстановитьПараметр("Уровень", Справочники.EscalationLevels.Level1);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Если НЕ МассивРезультатов[0].Пустой() Тогда
		РезультатЗапроса = МассивРезультатов[0];
	Иначе
		РезультатЗапроса = МассивРезультатов[1];
	КонецЕсли;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Получатель");
	
КонецФункции

Функция ПолучитьОтветственныхПоSOOracleSmith(СтруктураРеквизитовSO)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолучателиУведомленийUnbilled.Получатель
		|ИЗ
		|	РегистрСведений.ПолучателиУведомленийUnbilled КАК ПолучателиУведомленийUnbilled
		|ГДЕ
		|	ПолучателиУведомленийUnbilled.Source = &Source
		|	И ПолучателиУведомленийUnbilled.Идентификатор1 = &Идентификатор1
		|	И ПолучателиУведомленийUnbilled.Уровень = &Уровень
		|	И ПолучателиУведомленийUnbilled.Получатель.ResponsibleAR";
	
	Запрос.УстановитьПараметр("Source", Перечисления.ТипыСоответствий.OracleMI);
	Запрос.УстановитьПараметр("Идентификатор1", СтруктураРеквизитовSO.Location);
	Запрос.УстановитьПараметр("Уровень", Справочники.EscalationLevels.Level1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Получатель");
	
КонецФункции

Функция ПолучитьОтветственныхПоSOHOB(СтруктураРеквизитовSO)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолучателиУведомленийUnbilled.Получатель
		|ИЗ
		|	РегистрСведений.ПолучателиУведомленийUnbilled КАК ПолучателиУведомленийUnbilled
		|ГДЕ
		|	ПолучателиУведомленийUnbilled.Source = &Source
		|	И ПолучателиУведомленийUnbilled.Идентификатор1 = &Идентификатор1
		|	И ПолучателиУведомленийUnbilled.Уровень = &Уровень
		|	И ПолучателиУведомленийUnbilled.Получатель.ResponsibleAR
		|	И ПолучателиУведомленийUnbilled.Идентификатор2 = &Идентификатор2";
	
	Запрос.УстановитьПараметр("Source", Перечисления.ТипыСоответствий.HOBs);
	Запрос.УстановитьПараметр("Идентификатор1", СтруктураРеквизитовSO.Company);
	Запрос.УстановитьПараметр("Идентификатор2", СтруктураРеквизитовSO.CREW);
	Запрос.УстановитьПараметр("Уровень", Справочники.EscalationLevels.Level1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Получатель");
	
КонецФункции

#КонецЕсли
